{
    "Talk to Us": "تحدث إلينا",
    "Mail Us": "راسلنا",
    "Search": "بحث",
    "Dashboard": "لوحة التحكم",
    "You are logged in!": "تم تسجيل الدخول!",
    "Toggle navigation": "تبديل التنقل",
    "Home": "الرئيسية",
    "About Us": "من نحن",
    "Services": "خدماتنا",
    "International Transport": "النقل الدولي",
    "Local Track Transport": "النقل المحلي",
    "Fast Personal Delivery": "توصيل شخصي سريع",
    "Safe Ocean Transport": "نقل بحري آمن",
    "Warehouse Facility": "مرافق التخزين",
    "Emergency Transport": "نقل طارئ",
    "Jobs": "وظائف",
    "E-Services": "الخدمات الإلكترونية",
    "Tracking System": "نظام التتبع",
    "Portal": "البوابة",
    "Track Order": "تتبع الطلب",
    "Contact": "اتصل بنا",
    "Member": "عضو",
    "Login": "تسجيل الدخول",
    "Logistic service provider company plays a pivotal role in the global supply chain logistic service provider.": "تلعب شركة تقديم الخدمات اللوجستية دورًا محوريًا في سلسلة التوريد العالمية.",
    "Make a Call": "اتصل بنا",
    "Quick Links": "روابط سريعة",
    "Service": "خدمة",
    "Latest Project": "أحدث المشاريع",
    "Contact Us": "اتصل بنا",
    "Get In Touch": "تواصل معنا",
    "2775 King Abdulaziz Street Road": "2775 طريق الملك عبد العزيز",
    "Dammam, KSA": "الدمام، المملكة العربية السعودية",
    "Subscribe Us": "اشترك معنا",
    "Sign up for alerts, our latest blogs,": "اشترك للحصول على التنبيهات وأحدث المدونات،",
    "thoughts, and insights": "والأفكار والرؤى",
    "Subcribe": "اشترك",
    "search here": "ابحث هنا",
    "ABCLOGISTIC": "أيه بي سي لوجستيك",
    "Reliable Logistics Solutions": "حلول لوجستية موثوقة",
    "A logistics service provider is a key player in the global supply chain,": "مزود الخدمة اللوجستية هو لاعب رئيسي في سلسلة التوريد العالمية،",
    " ensuring the seamless coordination, transportation, and delivery of goods across borders and industries.": "مما يضمن التنسيق السلس والنقل وتسليم البضائع عبر الحدود والصناعات.",
    "Dammam": "الدمام",
    "Riyadh City": "مدينة الرياض",
    "Jeddah": "جدة",
    "Jubail": "الجبيل",
    "Tabuk": "تبوك",
    "Neom": "نيوم",
    "Al hasa": "الأحساء",
    "Ras Alkhair": "رأس الخير",
    "Logistic service": "خدمة لوجستية",
    "provider": "مزود",
    "Our Company": "شركتنا",
    "Our Expertise Stands in": "خبرتنا تكمن في",
    "Logistics Solutions": "حلول اللوجستيات",
    "Founded in 2014 by businessman Mr. Zafer Mushabab Al-Jabri, ABC Logistics is a proud extension of the esteemed Al-Jabri family, renowned for its deep-rooted legacy in the transportation and logistics sector. Our journey began in 2006 with the establishment of Zafer Al-Jabri Transportation, which laid the foundation for what has become a distinguished logistics entity trusted by leading clients across Saudi Arabia. We specialize in delivering integrated logistics solutions that blend local expertise with global standards.": "تأسست شركة أيه بي سي لوجستيك في عام 2014 على يد رجل الأعمال السيد ظافر مشبب الجابري، وهي امتداد فخور لعائلة الجابري الكريمة، المشهورة بإرثها العميق في قطاع النقل والخدمات اللوجستية. بدأت رحلتنا في عام 2006 بتأسيس مؤسسة ظافر الجابري للنقل، التي وضعت الأساس لما أصبح كيانًا لوجستيًا متميزًا يحظى بثقة كبار العملاء في جميع أنحاء المملكة العربية السعودية. نحن متخصصون في تقديم حلول لوجستية متكاملة تمزج بين الخبرة المحلية والمعايير العالمية.",
    "Top-Tier Services": "خدمات من الدرجة الأولى",
    "Providing the highest quality logistics and transportation services across The Country.": "توفير أعلى جودة من الخدمات اللوجستية والنقل في جميع أنحاء البلاد.",
    "24/7 Dedicated Support": "دعم مخصص 24/7",
    "Our expert team is available around the clock to ensure smooth operations.": "فريق الخبراء لدينا متاح على مدار الساعة لضمان سير العمليات بسلاسة.",
    "More About Us": "المزيد عنا",
    "Make A Phone Call": "قم بإجراء مكالمة",
    "IN BUSINESS SINCE 2006": "في العمل منذ عام 2006",
    "Our Service": "خدماتنا",
    "Empowering Your Business": "تمكين أعمالك",
    "With Smart Logistics Solutions": "مع حلول لوجستية ذكية",
    "Project Cargo": "شحن المشاريع",
    "Expertly managing oversized and complex cargo with precision and safety.": "إدارة البضائع الضخمة والمعقدة بدقة وأمان.",
    "Read More": "اقرأ المزيد",
    "Customs Clearance": "التخليص الجمركي",
    "Streamlined customs processes for smooth and compliant shipments.": "عمليات جمركية مبسطة لشحنات سلسة ومتوافقة.",
    "Warehousing Solutions": "حلول التخزين",
    "Secure storage and efficient inventory management across Saudi Arabia.": "تخزين آمن وإدارة فعالة للمخزون في جميع أنحاء المملكة العربية السعودية.",
    "Container Handling": "مناولة الحاويات",
    "Efficient loading and unloading of containers for seamless transport.": "تحميل وتفريغ فعال للحاويات لنقل سلس.",
    "Supply Chain Management": "إدارة سلسلة التوريد",
    "Optimized logistics for efficient and cost-effective supply chains.": "لوجستيات محسنة لسلاسل توريد فعالة ومنخفضة التكلفة.",
    "Freight Management": "إدارة الشحن",
    "Coordinated freight solutions for timely and reliable deliveries.": "حلول شحن منسقة لتسليمات موثوقة وفي الوقت المناسب.",
    "Unmatched Transport Solutions": "حلول نقل لا مثيل لها",
    "Excellence in": "التميز في",
    "Transportation": "النقل",
    "Delivered": "تم التسليم",
    "Explore Our Expertise": "استكشف خبراتنا",
    "Heavy Duty": "الخدمة الشاقة",
    "Hydraulic Lowbed": "لوبد هيدروليكي",
    "Special Lowbed": "لوبد خاص",
    "Versatile Transport": "نقل متعدد الاستخدامات",
    "Flatbed & Lowbed": "سطحات ولوبد",
    "Specialized Transport": "نقل متخصص",
    "Fuel Tanker": "صهريج وقود",
    "Why Choose us": "لماذا تختارنا",
    "Efficient, Safe, & Swift": "فعال، آمن، وسريع",
    "Logistics": "اللوجستيات",
    "Solution!": "حلول!",
    "Trustworthy logistics with proven reliability": "لوجستيات جديرة بالثقة وموثوقية مثبتة",
    "Hard-working team dedicated to excellence": "فريق عمل دؤوب مكرس للتميز",
    "Always on time with seamless delivery": "دائمًا في الوقت المحدد مع تسليم سلس",
    "Competitive pricing for all transport services": "أسعار تنافسية لجميع خدمات النقل",
    "Comprehensive solutions with all equipment types": "حلول شاملة مع جميع أنواع المعدات",
    "Request a Quote": "اطلب عرض سعر",
    "Send Request": "أرسل الطلب",
    "Company Name": "اسم الشركة",
    "Email": "البريد الإلكتروني",
    "Phone": "الهاتف",
    "Loading Date": "تاريخ التحميل",
    "From": "من",
    "To": "إلى",
    "Weight (kg)": "الوزن (كجم)",
    "Length (m)": "الطول (م)",
    "Width (m)": "العرض (م)",
    "Height (m)": "الارتفاع (م)",
    "Select Freight Type": "اختر نوع الشحن",
    "Flatbed": "سطحة",
    "Lowbed": "لوبد",
    "Lowbed HYD": "لوبد هيدروليكي",
    "EX/10": "EX/10",
    "Select Load Type": "اختر نوع الحمولة",
    "Container": "حاوية",
    "Cargo": "بضائع",
    "Our Expertise": "خبراتنا",
    "Premier Logistics Solutions": "حلول لوجستية رائدة",
    "Trusted for": "موثوقة لـ",
    "Excellence": "التميز",
    "As a leading logistic service provider, we excel in orchestrating seamless supply chain solutions, ensuring goods move efficiently from origin to destination. Our expertise in shipping, management, and customs clearance sets us apart in delivering reliable and innovative transportation services.": "بصفتنا مزود خدمة لوجستية رائد، نتفوق في تنسيق حلول سلسلة التوريد السلسة، مما يضمن نقل البضائع بكفاءة من المصدر إلى الوجهة. خبرتنا في الشحن والإدارة والتخليص الجمركي تميزنا في تقديم خدمات نقل موثوقة ومبتكرة.",
    "Shipping": "الشحن",
    "Management": "الإدارة",
    "Book Your Shipment": "احجز شحنتك",
    "Welcome": "مرحبًا",
    "Your Trusted Logistics Partner": "شريكك اللوجستي الموثوق",
    "Experience Seamless": "جرب سلاسة",
    "Transportation with": "النقل مع",
    "Us": "نا",
    "Our Dedicated Team": "فريقنا المتفاني",
    "At Your Service 24/7": "في خدمتكم 24/7",
    "Welcome to our world of logistics excellence! Our team is committed to providing top-tier shipping, management, and customs clearance services, ensuring your goods move seamlessly from origin to destination. We guarantee reliable, efficient, and tailored solutions to meet your needs. Trust us to deliver unparalleled service, anytime, anywhere. Join us today and experience logistics done right!": "مرحبًا بكم في عالم التميز اللوجستي! يلتزم فريقنا بتقديم خدمات شحن وإدارة وتخليص جمركي من الدرجة الأولى، مما يضمن نقل البضائع بسلاسة من المصدر إلى الوجهة. نحن نضمن حلولاً موثوقة وفعالة ومصممة خصيصًا لتلبية احتياجاتك. ثق بنا لتقديم خدمة لا مثيل لها، في أي وقت وفي أي مكان. انضم إلينا اليوم وجرب الخدمات اللوجستية بالطريقة الصحيحة!",
    "Why Us": "لماذا نحن",
    "Some Goods": "بعض البضائع",
    "We Handle": "التي نتعامل معها",
    "Our Solutions": "حلولنا",
    "Safe Handling": "مناولة آمنة",
    "Bulk Goods": "بضائع سائبة",
    "Transporting grains, minerals, and other bulk materials securely.": "نقل الحبوب والمعادن والمواد السائبة الأخرى بأمان.",
    "Containers": "حاويات",
    "Secure containerized shipping for global reach.": "شحن آمن بالحاويات للوصول العالمي.",
    "Heavy Equipment": "معدات ثقيلة",
    "Specialized transport for construction and industrial equipment.": "نقل متخصص لمعدات البناء والصناعة.",
    "Factory Machinery": "آلات المصانع",
    "We move your critical factory machines with care.": "ننقل آلات المصنع الحيوية الخاصة بك بعناية.",
    "Fuels": "الوقود",
    "Compliant and safe transport of various fuel types.": "نقل متوافق وآمن لأنواع الوقود المختلفة.",
    "Reels & Coils": "بكرات وملفات",
    "Cable reels, steel coils, and more—transported with precision.": "بكرات الكابلات، والملفات الفولاذية، والمزيد - يتم نقلها بدقة.",
    "Iron & Timber": "حديد وأخشاب",
    "Handling structural materials with maximum safety.": "التعامل مع المواد الإنشائية بأقصى درجات الأمان.",
    "Foodstuffs": "مواد غذائية",
    "Fresh and dry food products delivered under hygiene control.": "توصيل المنتجات الغذائية الطازجة والجافة تحت رقابة صحية.",
    "Refrigerated Goods": "بضائع مبردة",
    "Maintaining cold chain integrity for perishable items.": "الحفاظ على سلامة سلسلة التبريد للمواد القابلة للتلف.",
    "Trucks": "شاحنات",
    "Completed Projects": "مشاريع مكتملة",
    "Employees": "موظفين",
    "Company's FAQ": "الأسئلة الشائعة للشركة",
    "Got Questions?": "هل لديك أسئلة؟",
    "We Have": "لدينا",
    "Answers": "الإجابات",
    "How do you ensure timely delivery of shipments?": "كيف تضمنون تسليم الشحنات في الوقت المحدد؟",
    "Our advanced logistics management systems and dedicated team optimize every step of the shipping process. We use real-time tracking and efficient routing to ensure your goods arrive on schedule, every time.": "تعمل أنظمة إدارة اللوجستيات المتقدمة وفريقنا المتفاني على تحسين كل خطوة في عملية الشحن. نستخدم التتبع في الوقت الفعلي والتوجيه الفعال لضمان وصول بضائعك في الموعد المحدد، في كل مرة.",
    "What makes your customs clearance process efficient?": "ما الذي يجعل عملية التخليص الجمركي لديكم فعالة؟",
    "Our expertise in customs regulations streamline the clearance process. We handle all documentation and compliance requirements to minimize delays and ensure smooth shipments.": "خبرتنا في اللوائح الجمركية تبسط عملية التخليص. نتعامل مع جميع الوثائق ومتطلبات الامتثال لتقليل التأخير وضمان شحنات سلسة.",
    "Can I track my shipment in real time?": "هل يمكنني تتبع شحنتي في الوقت الفعلي؟",
    "Yes, we provide a user-friendly tracking platform that allows you to monitor your shipment’s status in real time. From pickup to delivery, you’ll have full visibility and updates on your Order.": "نعم، نوفر منصة تتبع سهلة الاستخدام تتيح لك مراقبة حالة شحنتك في الوقت الفعلي. من الاستلام إلى التسليم، ستتمتع برؤية كاملة وتحديثات حول طلبك.",
    "How do you handle unexpected delays or issues?": "كيف تتعاملون مع التأخيرات أو المشكلات غير المتوقعة؟",
    "Our 24/7 support team proactively manages any disruptions, from weather delays to logistical challenges. We communicate promptly and implement contingency plans to keep your shipment on track with minimal impact.": "يدير فريق الدعم لدينا الذي يعمل على مدار الساعة طوال أيام الأسبوع أي اضطرابات بشكل استباقي، من تأخيرات الطقس إلى التحديات اللوجستية. نتواصل بسرعة وننفذ خطط طوارئ للحفاظ على مسار شحنتك بأقل تأثير ممكن.",
    "100% TRUSTED TRANSPORT": "نقل موثوق 100%",
    "Ensuring Timely Deliveries with": "ضمان التسليم في الوقت المناسب مع",
    "Our Expert": "خبرائنا",
    "Maintenance Team": "فريق الصيانة",
    "Our dedicated maintenance team is available 24/7 to address any issue, ensuring your shipments arrive on time, every time. Trust us for seamless logistics solutions.": "فريق الصيانة المتفاني لدينا متاح على مدار الساعة طوال أيام الأسبوع لمعالجة أي مشكلة، مما يضمن وصول شحناتك في الوقت المحدد، في كل مرة. ثق بنا للحصول على حلول لوجستية سلسة.",
    "Search Here...": "ابحث هنا...",
    "Go Back Top": "العودة للأعلى"
}